
__author__ = 'Петров Андрей'

# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.

from random import randint
a = randint(0, 99999999)
print('Рандомное число', a)

a = str(a) #смена типа

i = 0

while i < len(a):
    print(a[i])
    i += 1

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную 
#   или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!

phone = input('Введите телефон: ')
email = input('Введите email: ')

# c буферной переменной
a = phone
phone = email
email = a
print('Упс, кажеться я все перепутал')
print('Ваш телефон:', phone)
print('Ваш email:', email)


      
# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"

age = input('Сколько Вам лет?: ')
while True:
    if not(age.isdigit()):
        print('Пожалуйста введите число')
        age = input('Сколько Вам лет?: ')
    elif int(age) < 18:
        print('Извините, пользование данным ресурсом только с 18 лет')
        break
    else:
        print('Доступ разрешен')
        break